[
    {
        "number": "Стаття 114. Шпигунство",
        "content": "1. Передача або збирання з метою передачі іноземній державі, іноземній організації або їх представникам відомостей, що становлять державну таємницю, якщо ці дії вчинені іноземцем або особою без громадянства, -караються позбавленням волі на строк від десяти до п’ятнадцяти років з конфіскацією майна або без такої.2. Звільняється від кримінальної відповідальності особа, яка припинила діяльність, передбачену частиною першою цієї статті, та добровільно повідомила органи державної влади про вчинене, якщо внаслідок цього і вжитих заходів було відвернено заподіяння шкоди інтересам України."
    },
    {
        "number": "Стаття 232. Розголошення комерційної або банківської таємниці",
        "content": "Умисне розголошення комерційної або банківської таємниці без згоди її власника особою, якій ця таємниця відома у зв`язку з професійною або службовою діяльністю, якщо воно вчинене з корисливих чи інших особистих мотивів і завдало істотної шкоди суб`єкту господарської діяльності, -карається штрафом від однієї тисячі до трьох тисяч неоподатковуваних мінімумів доходів громадян з позбавленням права обіймати певні посади чи займатися певною діяльністю на строк до трьох років."
    },
    {
        "number": "Стаття 328. Розголошення державної таємниці",
        "content": "1. Розголошення відомостей, що становлять державну таємницю, особою, якій ці відомості були довірені або стали відомі у зв`язку з виконанням службових обов`язків, за відсутності ознак державної зради або шпигунства - карається позбавленням волі на строк від двох до п`яти років з позбавленням права обіймати певні посади чи займатися певною діяльністю на строк до трьох років або без такого. 2. Те саме діяння, якщо воно спричинило тяжкі наслідки, -карається позбавленням волі на строк від п`яти до восьми років."
    },
    {
        "number": "Стаття 329. Втрата документів, що містять державну таємницю",
        "content": "1. Втрата документів або інших матеріальних носіїв секретної інформації, що містять державну таємницю, а також предметів, відомості про які становлять державну таємницю, особою, якій вони були довірені, якщо втрата стала результатом порушення встановленого законом порядку поводження із зазначеними документами та іншими матеріальними носіями секретної інформації або предметами, -карається позбавленням волі на строк до трьох років з позбавленням права обіймати певні посади чи займатися певною діяльністю на строк до трьох років або без такого.2. Те саме діяння, якщо воно спричинило тяжкі наслідки, -карається позбавленням волі на строк від двох до п`яти років."
    },
    {
        "number": "Стаття 422. Розголошення відомостей військового характеру, що становлять державну таємницю, або втрата документів чи матеріалів, що містять такі відомості",
        "content": "1. Розголошення відомостей військового характеру, що становлять державну таємницю, за відсутності ознак державної зради -карається позбавленням волі на строк від двох до п`яти років.2. Втрата документів або матеріалів, що містять відомості військового характеру, які становлять державну таємницю, предметів, відомості про які становлять державну таємницю, особою, якій вони були довірені, якщо втрата стала результатом порушення встановлених правил поводження із зазначеними документами, матеріалами або предметами, -карається позбавленням волі на строк від двох до п`яти років.3. Діяння, передбачені частинами першою або другою цієї статті, якщо вони спричинили тяжкі наслідки, -караються позбавленням волі на строк від п`яти до десяти років."
    }
]
